---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextFont
source: html/09b6c8ca-9608-06e0-3e3f-c1698a2ec81e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextFont Property

"Text Font"

## Syntax (C#)
```csharp
public static ForgeTypeId TextFont { get; }
```